<?php
/**
 * アプリケーション全般の設定
 */
return [
    /*
    |--------------------------------------------------------------------------
    | アプリケーション名
    |--------------------------------------------------------------------------
    |
    | アプリケーション名はアプリケーション全体で使用される値です。
    |
    */
    'name' => $_ENV['APP_NAME'] ?? '花見調整サイト',

    /*
    |--------------------------------------------------------------------------
    | アプリケーション環境
    |--------------------------------------------------------------------------
    |
    | この値はアプリケーションの現在の環境を判断するために使用されます。
    | 'production'、'development'、'testing'などの値が設定可能です。
    |
    */
    'env' => $_ENV['APP_ENV'] ?? 'production',

    /*
    |--------------------------------------------------------------------------
    | アプリケーションURL
    |--------------------------------------------------------------------------
    |
    | アプリケーションのベースURLを設定します。
    |
    */
    'url' => $_ENV['APP_URL'] ?? 'http://localhost',

    /*
    |--------------------------------------------------------------------------
    | タイムゾーン
    |--------------------------------------------------------------------------
    |
    | アプリケーションのデフォルトタイムゾーンを指定します。
    |
    */
    'timezone' => 'Asia/Tokyo',

    /*
    |--------------------------------------------------------------------------
    | 文字エンコーディング
    |--------------------------------------------------------------------------
    |
    | アプリケーションのデフォルト文字エンコーディングを指定します。
    |
    */
    'encoding' => 'UTF-8',

    /*
    |--------------------------------------------------------------------------
    | リアルタイム更新設定
    |--------------------------------------------------------------------------
    |
    | リアルタイム更新のためのPusherの設定
    |
    */
    'pusher' => [
        'app_id' => $_ENV['PUSHER_APP_ID'] ?? '',
        'app_key' => $_ENV['PUSHER_APP_KEY'] ?? '',
        'app_secret' => $_ENV['PUSHER_APP_SECRET'] ?? '',
        'cluster' => $_ENV['PUSHER_APP_CLUSTER'] ?? 'ap3',
        'encrypted' => true,
    ],
];
